<template>
  <div class="secret">
    <p class="title">隐私政策</p>
    <p class="content">
      岁月间对用户实行全面免费开发注册和升级。任何第三方公司与个人通过岁月间开放平台，都可以深度结合岁月间用户的开放信息，开发出完全个性化、富于互动性的岁月间应用技术。<br/>
       1.尊重用户个人隐私是岁月间的一项基本政策，岁月间保证不对外公开或向第三方提供用户申请资料及用户在使用服务时存储在岁月间的非公开内容，但下列情况除外：<pre>
        a.事先获得用户的明确授权；
        b.根据有关的法律法规要求；
        c.按照相关政府主管部门的要求；
        d.为维护社会公众的利益；
        e.为维护岁月间的合法权益。</pre>
       2.岁月间可能会与第三方合作向用户提供相关的服务，在此情况下，如该第三方同意承担与岁月间同等的保护用户隐私的责任，则岁月间可将用户的申请资料等提供给该第三方。<br/>
       3.在不透露单个用户隐私资料的前提下，岁月间有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。用户单独承担发布内容的责任。用户对服务的使用是根据所有适用于服务的地方法律、国家法律和国际法律标准的。用户承诺：<br/>
    1.在岁月间的网页上发布信息或者利用岁月间的服务时必须符合中国有关法规(部分法规请见附录)，不得在岁月间的网页上或者利用岁月间的服务制作、复制、发布、传播以下信息：<pre>
    (a)反对宪法所确定的基本原则的；
    (b)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
    (c)损害国家荣誉和利益的；
    (d)煽动民族仇恨、民族歧视，破坏民族团结的；
    (e)破坏国家宗教政策，宣扬邪教和封建迷信的；
    (f)散布谣言，扰乱社会秩序，破坏社会稳定的；
    (g)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
    (h)侮辱或者诽谤他人，侵害他人合法权益的；
    (i)含有法律、行政法规禁止的其他内容的。</pre>
    2.在岁月间的网页上发布信息或者利用岁月间的服务时还必须符合其他有关国家和地区的法律规定以及国际法的有关规定。<br/><pre>
    3.不利用岁月间的服务从事以下活动：
    (a)故意制作、传播计算机病毒等破坏岁月间程序的；
    (b)其他危害计算机信息网络安全的行为。
    4.不以任何方式干扰岁月间的服务。
    5.遵守岁月间的所有其他规定。</pre>
    (a)用户需对自己在使用岁月间服务过程中的行为承担法律责任。用户理解，如果岁月间发现其网站传输的信息明显属于上段第(1)条所列内容之一，依据中国法律，岁月间有义务立即停止传输，保存有关记录，向国家有关机关报告，并且删除含有该内容的地址、目录或关闭服务器。<br/>
    (b)用户使用岁月间服务，发布笔记以交互形式为上网用户提供信息发布条件的行为，也须遵守本条的规定以及岁月间将专门发布的电子公告服务规则，上段中描述的法律后果和法律责任同样适用于电子公告服务的用户。<br/>
    6.若用户的行为不符合以上提到的服务条款，岁月间将作出独立判断立即取消用户服务帐号。<br/>
    </p>
  </div>
</template>

<script>
export default {

  name: 'Secret',

  data () {
    return {

    }
  }
};
</script>

<style lang="css" scoped>
.title{
  justify-content: center;
    display: flex;
    margin: 20px;
    font-size: 20px;
    color: #FF5722;
    font-weight: 700;
}
.content{
  font-size: 15px;
  line-height: 30px;
}
</style>
